Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.UxSpring Property
 The displacement in the X-axis direction (N/mm).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double UxSpring { get; set; }
Public Property UxSpring As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisRestraintData Class
Tekla.Structures.Analysis Namespace